zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_SIUL2.h
  __IO uint8_t GPDO199;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13C4 */
  __IO uint8_t GPDO198;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13C5 */
  __IO uint8_t GPDO197;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13C6 */
  __IO uint8_t GPDO196;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13C7 */
  __IO uint8_t GPDO203;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13C8 */
  __IO uint8_t GPDO202;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13C9 */
  __IO uint8_t GPDO201;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13CA */
  __IO uint8_t GPDO200;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13CB */
  __IO uint8_t GPDO207;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13CC */
  __IO uint8_t GPDO206;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13CD */
  __IO uint8_t GPDO205;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13CE */
  __IO uint8_t GPDO204;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13CF */
  __IO uint8_t GPDO211;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13D0 */
  __IO uint8_t GPDO210;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13D1 */
  __IO uint8_t GPDO209;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13D2 */
  __IO uint8_t GPDO208;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13D3 */
  __IO uint8_t GPDO215;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13D4 */
  __IO uint8_t GPDO214;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13D5 */
  __IO uint8_t GPDO213;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13D6 */
  __IO uint8_t GPDO212;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13D7 */
  __IO uint8_t GPDO219;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13D8 */
  __IO uint8_t GPDO218;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13D9 */
  __IO uint8_t GPDO217;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13DA */
  __IO uint8_t GPDO216;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13DB */
  uint8_t RESERVED_24[8];
  __IO uint8_t GPDO231;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13E4 */
  uint8_t RESERVED_25[3];
  __IO uint8_t GPDO235;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13E8 */
  __IO uint8_t GPDO234;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13E9 */
  __IO uint8_t GPDO233;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13EA */
  __IO uint8_t GPDO232;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13EB */
  uint8_t RESERVED_26[3];
  __IO uint8_t GPDO236;                            /**< SIUL2 GPIO Pad Data Output, offset: 0x13EF */
  uint8_t RESERVED_27[272];
  __I  uint8_t GPDI3;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1500 */
  __I  uint8_t GPDI2;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1501 */
  __I  uint8_t GPDI1;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1502 */
  __I  uint8_t GPDI0;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1503 */
  __I  uint8_t GPDI7;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1504 */
  __I  uint8_t GPDI6;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1505 */
  __I  uint8_t GPDI5;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1506 */
  __I  uint8_t GPDI4;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x1507 */
  uint8_t RESERVED_28[1];
  __I  uint8_t GPDI10;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1509 */
  __I  uint8_t GPDI9;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x150A */
  __I  uint8_t GPDI8;                              /**< SIUL2 GPIO Pad Data Input, offset: 0x150B */
  __I  uint8_t GPDI15;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x150C */
  __I  uint8_t GPDI14;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x150D */
  uint8_t RESERVED_29[2];
  __I  uint8_t GPDI19;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1510 */
  __I  uint8_t GPDI18;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1511 */
  __I  uint8_t GPDI17;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1512 */
  __I  uint8_t GPDI16;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1513 */
  __I  uint8_t GPDI23;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1514 */
  __I  uint8_t GPDI22;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1515 */
  __I  uint8_t GPDI21;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1516 */
  __I  uint8_t GPDI20;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1517 */
  uint8_t RESERVED_30[1];
  __I  uint8_t GPDI26;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1519 */
  __I  uint8_t GPDI25;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151A */
  __I  uint8_t GPDI24;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151B */
  __I  uint8_t GPDI31;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151C */
  __I  uint8_t GPDI30;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151D */
  __I  uint8_t GPDI29;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151E */
  __I  uint8_t GPDI28;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x151F */
  __I  uint8_t GPDI35;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1520 */
  __I  uint8_t GPDI34;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1521 */
  __I  uint8_t GPDI33;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1522 */
  __I  uint8_t GPDI32;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1523 */
  uint8_t RESERVED_31[2];
  __I  uint8_t GPDI37;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1526 */
  __I  uint8_t GPDI36;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1527 */
  __I  uint8_t GPDI43;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1528 */
  __I  uint8_t GPDI42;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1529 */
  __I  uint8_t GPDI41;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152A */
  __I  uint8_t GPDI40;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152B */
  __I  uint8_t GPDI47;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152C */
  __I  uint8_t GPDI46;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152D */
  __I  uint8_t GPDI45;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152E */
  __I  uint8_t GPDI44;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152F */
  __I  uint8_t GPDI51;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1530 */
  __I  uint8_t GPDI50;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1531 */
  __I  uint8_t GPDI49;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1532 */
  __I  uint8_t GPDI48;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1533 */
  __I  uint8_t GPDI55;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1534 */
  __I  uint8_t GPDI54;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1535 */
  __I  uint8_t GPDI53;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1536 */
  __I  uint8_t GPDI52;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1537 */
  __I  uint8_t GPDI59;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1538 */
  __I  uint8_t GPDI58;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1539 */
  __I  uint8_t GPDI57;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x153A */
  __I  uint8_t GPDI56;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x153B */
  uint8_t RESERVED_32[2];
  __I  uint8_t GPDI61;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x153E */
  __I  uint8_t GPDI60;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x153F */
  __I  uint8_t GPDI67;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1540 */
  __I  uint8_t GPDI66;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1541 */
  __I  uint8_t GPDI65;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1542 */
  __I  uint8_t GPDI64;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1543 */
  __I  uint8_t GPDI71;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1544 */
  __I  uint8_t GPDI70;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1545 */
  __I  uint8_t GPDI69;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1546 */
  __I  uint8_t GPDI68;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1547 */
  __I  uint8_t GPDI75;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1548 */
  __I  uint8_t GPDI74;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1549 */
  __I  uint8_t GPDI73;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154A */
  __I  uint8_t GPDI72;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154B */
  __I  uint8_t GPDI79;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154C */
  __I  uint8_t GPDI78;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154D */
  __I  uint8_t GPDI77;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154E */
  __I  uint8_t GPDI76;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154F */
  __I  uint8_t GPDI83;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1550 */
  __I  uint8_t GPDI82;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1551 */
  __I  uint8_t GPDI81;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1552 */
  __I  uint8_t GPDI80;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1553 */
  __I  uint8_t GPDI87;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1554 */
  uint8_t RESERVED_33[1];
  __I  uint8_t GPDI85;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1556 */
  __I  uint8_t GPDI84;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1557 */
  __I  uint8_t GPDI91;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1558 */
  __I  uint8_t GPDI90;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1559 */
  __I  uint8_t GPDI89;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155A */
  __I  uint8_t GPDI88;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155B */
  __I  uint8_t GPDI95;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155C */
  __I  uint8_t GPDI94;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155D */
  __I  uint8_t GPDI93;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155E */
  __I  uint8_t GPDI92;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155F */
  __I  uint8_t GPDI99;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1560 */
  __I  uint8_t GPDI98;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1561 */
  __I  uint8_t GPDI97;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1562 */
  __I  uint8_t GPDI96;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1563 */
  __I  uint8_t GPDI103;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1564 */
  __I  uint8_t GPDI102;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1565 */
  __I  uint8_t GPDI101;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1566 */
  __I  uint8_t GPDI100;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1567 */
  __I  uint8_t GPDI107;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1568 */
  __I  uint8_t GPDI106;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1569 */
  __I  uint8_t GPDI105;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156A */
  __I  uint8_t GPDI104;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156B */
  __I  uint8_t GPDI111;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156C */
  __I  uint8_t GPDI110;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156D */
  __I  uint8_t GPDI109;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156E */
  __I  uint8_t GPDI108;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156F */
  __I  uint8_t GPDI115;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1570 */
  __I  uint8_t GPDI114;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1571 */
  __I  uint8_t GPDI113;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1572 */
  __I  uint8_t GPDI112;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1573 */
  __I  uint8_t GPDI119;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1574 */
  __I  uint8_t GPDI118;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1575 */
  __I  uint8_t GPDI117;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1576 */
  __I  uint8_t GPDI116;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1577 */
  __I  uint8_t GPDI123;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1578 */
  __I  uint8_t GPDI122;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1579 */
  __I  uint8_t GPDI121;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x157A */
  __I  uint8_t GPDI120;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x157B */
  __I  uint8_t GPDI127;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x157C */
  __I  uint8_t GPDI126;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x157D */
  __I  uint8_t GPDI125;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x157E */
  __I  uint8_t GPDI124;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x157F */
  uint8_t RESERVED_34[1];
  __I  uint8_t GPDI130;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1581 */
  __I  uint8_t GPDI129;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1582 */
  __I  uint8_t GPDI128;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1583 */
  __I  uint8_t GPDI135;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1584 */
  __I  uint8_t GPDI134;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1585 */
  __I  uint8_t GPDI133;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1586 */
  __I  uint8_t GPDI132;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1587 */
  __I  uint8_t GPDI139;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1588 */
  __I  uint8_t GPDI138;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1589 */
  __I  uint8_t GPDI137;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x158A */
  __I  uint8_t GPDI136;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x158B */
  __I  uint8_t GPDI143;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x158C */
  __I  uint8_t GPDI142;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x158D */
  uint8_t RESERVED_35[1];
  __I  uint8_t GPDI140;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x158F */
  __I  uint8_t GPDI147;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1590 */
  __I  uint8_t GPDI146;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1591 */
  __I  uint8_t GPDI145;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1592 */
  __I  uint8_t GPDI144;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1593 */
  __I  uint8_t GPDI151;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1594 */
  uint8_t RESERVED_36[1];
  __I  uint8_t GPDI149;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1596 */
  __I  uint8_t GPDI148;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1597 */
  __I  uint8_t GPDI155;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1598 */
  __I  uint8_t GPDI154;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1599 */
  uint8_t RESERVED_37[2];
  __I  uint8_t GPDI159;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x159C */
  __I  uint8_t GPDI158;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x159D */
  __I  uint8_t GPDI157;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x159E */
  __I  uint8_t GPDI156;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x159F */
  __I  uint8_t GPDI163;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15A0 */
  __I  uint8_t GPDI162;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15A1 */
  __I  uint8_t GPDI161;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15A2 */
  __I  uint8_t GPDI160;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15A3 */
  __I  uint8_t GPDI167;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15A4 */
  __I  uint8_t GPDI166;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15A5 */
  __I  uint8_t GPDI165;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15A6 */
  __I  uint8_t GPDI164;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15A7 */
  __I  uint8_t GPDI171;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15A8 */
  __I  uint8_t GPDI170;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15A9 */
  __I  uint8_t GPDI169;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15AA */
  __I  uint8_t GPDI168;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15AB */
  __I  uint8_t GPDI175;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15AC */
  __I  uint8_t GPDI174;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15AD */
  __I  uint8_t GPDI173;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15AE */
  __I  uint8_t GPDI172;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15AF */
  __I  uint8_t GPDI179;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15B0 */
  __I  uint8_t GPDI178;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15B1 */
  __I  uint8_t GPDI177;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15B2 */
  __I  uint8_t GPDI176;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15B3 */
  __I  uint8_t GPDI183;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15B4 */
  uint8_t RESERVED_38[1];
  __I  uint8_t GPDI181;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15B6 */
  __I  uint8_t GPDI180;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15B7 */
  __I  uint8_t GPDI187;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15B8 */
  __I  uint8_t GPDI186;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15B9 */
  __I  uint8_t GPDI185;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15BA */
  __I  uint8_t GPDI184;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15BB */
  __I  uint8_t GPDI191;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15BC */
  __I  uint8_t GPDI190;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15BD */
  __I  uint8_t GPDI189;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15BE */
  __I  uint8_t GPDI188;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15BF */
  __I  uint8_t GPDI195;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C0 */
  __I  uint8_t GPDI194;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C1 */
  __I  uint8_t GPDI193;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C2 */
  __I  uint8_t GPDI192;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C3 */
  __I  uint8_t GPDI199;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C4 */
  __I  uint8_t GPDI198;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C5 */
  __I  uint8_t GPDI197;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C6 */
  __I  uint8_t GPDI196;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C7 */
  __I  uint8_t GPDI203;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C8 */
  __I  uint8_t GPDI202;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15C9 */
  __I  uint8_t GPDI201;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CA */
  __I  uint8_t GPDI200;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CB */
  __I  uint8_t GPDI207;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CC */
  __I  uint8_t GPDI206;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CD */
  __I  uint8_t GPDI205;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CE */
  __I  uint8_t GPDI204;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15CF */
  __I  uint8_t GPDI211;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D0 */
  __I  uint8_t GPDI210;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D1 */
  __I  uint8_t GPDI209;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D2 */
  __I  uint8_t GPDI208;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D3 */
  __I  uint8_t GPDI215;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D4 */
  __I  uint8_t GPDI214;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D5 */
  __I  uint8_t GPDI213;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D6 */
  __I  uint8_t GPDI212;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D7 */
  __I  uint8_t GPDI219;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D8 */
  __I  uint8_t GPDI218;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15D9 */
