zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_SIUL2.h
  __I  uint8_t GPDI217;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15DA */
  __I  uint8_t GPDI216;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15DB */
  uint8_t RESERVED_39[8];
  __I  uint8_t GPDI231;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E4 */
  uint8_t RESERVED_40[3];
  __I  uint8_t GPDI235;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E8 */
  __I  uint8_t GPDI234;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15E9 */
  __I  uint8_t GPDI233;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15EA */
  __I  uint8_t GPDI232;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15EB */
  uint8_t RESERVED_41[3];
  __I  uint8_t GPDI236;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x15EF */
  uint8_t RESERVED_42[272];
  __IO uint16_t PGPDO1;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1700 */
  __IO uint16_t PGPDO0;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1702 */
  __IO uint16_t PGPDO3;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1704 */
  __IO uint16_t PGPDO2;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1706 */
  __IO uint16_t PGPDO5;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1708 */
  __IO uint16_t PGPDO4;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x170A */
  __IO uint16_t PGPDO7;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x170C */
  __IO uint16_t PGPDO6;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x170E */
  __IO uint16_t PGPDO9;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1710 */
  __IO uint16_t PGPDO8;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1712 */
  __IO uint16_t PGPDO11;                           /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1714 */
  __IO uint16_t PGPDO10;                           /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1716 */
  __IO uint16_t PGPDO13;                           /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1718 */
  __IO uint16_t PGPDO12;                           /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x171A */
  uint8_t RESERVED_43[2];
  __IO uint16_t PGPDO14;                           /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x171E */
  uint8_t RESERVED_44[32];
  __I  uint16_t PGPDI1;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1740 */
  __I  uint16_t PGPDI0;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1742 */
  __I  uint16_t PGPDI3;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1744 */
  __I  uint16_t PGPDI2;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1746 */
  __I  uint16_t PGPDI5;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1748 */
  __I  uint16_t PGPDI4;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x174A */
  __I  uint16_t PGPDI7;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x174C */
  __I  uint16_t PGPDI6;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x174E */
  __I  uint16_t PGPDI9;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1750 */
  __I  uint16_t PGPDI8;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1752 */
  __I  uint16_t PGPDI11;                           /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1754 */
  __I  uint16_t PGPDI10;                           /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1756 */
  __I  uint16_t PGPDI13;                           /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1758 */
  __I  uint16_t PGPDI12;                           /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x175A */
  uint8_t RESERVED_45[2];
  __I  uint16_t PGPDI14;                           /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x175E */
  uint8_t RESERVED_46[32];
  __O  uint32_t MPGPDO[SIUL2_MPGPDO_COUNT];        /**< SIUL2 Masked Parallel GPIO Pad Data Out, array offset: 0x1780, array step: 0x4 */
} SIUL2_Type, *SIUL2_MemMapPtr;

/** Number of instances of the SIUL2 module. */
#define SIUL2_INSTANCE_COUNT                     (1u)

/* SIUL2 - Peripheral instance base addresses */
/** Peripheral SIUL2 base address */
#define IP_SIUL2_BASE                            (0x40290000u)
/** Peripheral SIUL2 base pointer */
#define IP_SIUL2                                 ((SIUL2_Type *)IP_SIUL2_BASE)
/** Array initializer of SIUL2 peripheral base addresses */
#define IP_SIUL2_BASE_ADDRS                      { IP_SIUL2_BASE }
/** Array initializer of SIUL2 peripheral base pointers */
#define IP_SIUL2_BASE_PTRS                       { IP_SIUL2 }

/* ----------------------------------------------------------------------------
   -- SIUL2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIUL2_Register_Masks SIUL2 Register Masks
 * @{
 */

/*! @name MIDR1 - SIUL2 MCU ID Register #1 */
/*! @{ */

#define SIUL2_MIDR1_MINOR_MASK_MASK              (0xFU)
#define SIUL2_MIDR1_MINOR_MASK_SHIFT             (0U)
#define SIUL2_MIDR1_MINOR_MASK_WIDTH             (4U)
#define SIUL2_MIDR1_MINOR_MASK(x)                (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR1_MINOR_MASK_SHIFT)) & SIUL2_MIDR1_MINOR_MASK_MASK)

#define SIUL2_MIDR1_MAJOR_MASK_MASK              (0xF0U)
#define SIUL2_MIDR1_MAJOR_MASK_SHIFT             (4U)
#define SIUL2_MIDR1_MAJOR_MASK_WIDTH             (4U)
#define SIUL2_MIDR1_MAJOR_MASK(x)                (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR1_MAJOR_MASK_SHIFT)) & SIUL2_MIDR1_MAJOR_MASK_MASK)

#define SIUL2_MIDR1_PART_NO_MASK                 (0x3FF0000U)
#define SIUL2_MIDR1_PART_NO_SHIFT                (16U)
#define SIUL2_MIDR1_PART_NO_WIDTH                (10U)
#define SIUL2_MIDR1_PART_NO(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR1_PART_NO_SHIFT)) & SIUL2_MIDR1_PART_NO_MASK)

