zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_SIUL2.h
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC0INT_EN_MASK (0x800U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC0INT_EN_SHIFT (11U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC0INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC0INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1ADC0INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1ADC0INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC1INT_EN_MASK (0x1000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC1INT_EN_SHIFT (12U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC1INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC1INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1ADC1INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1ADC1INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC2INT_EN_MASK (0x2000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC2INT_EN_SHIFT (13U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC2INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC2INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1ADC2INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1ADC2INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC3INT_EN_MASK (0x4000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC3INT_EN_SHIFT (14U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC3INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC3INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1ADC3INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1ADC3INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0DMA_EN_MASK (0x10000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0DMA_EN_SHIFT (16U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1DMA_EN_MASK (0x20000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1DMA_EN_SHIFT (17U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2DMA_EN_MASK (0x40000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2DMA_EN_SHIFT (18U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC0DMA_EN_MASK (0x80000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC0DMA_EN_SHIFT (19U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC0DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC0DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0ADC0DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0ADC0DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC1DMA_EN_MASK (0x100000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC1DMA_EN_SHIFT (20U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC1DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC1DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0ADC1DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0ADC1DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC2DMA_EN_MASK (0x200000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC2DMA_EN_SHIFT (21U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC2DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC2DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0ADC2DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0ADC2DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0INT_EN_MASK (0x400000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0INT_EN_SHIFT (22U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0FIFO0INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1INT_EN_MASK (0x800000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1INT_EN_SHIFT (23U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0FIFO1INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2INT_EN_MASK (0x1000000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2INT_EN_SHIFT (24U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0FIFO2INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0LISTINT_EN_MASK (0x2000000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0LISTINT_EN_SHIFT (25U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0LISTINT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0LISTINT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0LISTINT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0LISTINT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC0INT_EN_MASK (0x4000000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC0INT_EN_SHIFT (26U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC0INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC0INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0ADC0INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0ADC0INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC1INT_EN_MASK (0x8000000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC1INT_EN_SHIFT (27U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC1INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC1INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0ADC1INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0ADC1INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC2INT_EN_MASK (0x10000000U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC2INT_EN_SHIFT (28U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC2INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU0ADC2INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU0ADC2INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU0ADC2INT_EN_MASK)
/*! @} */

/*! @name MUX1_TIMER_EN0 - MUX1_TIMER_EN0 */
/*! @{ */

#define SIUL2_MUX1_TIMER_EN0_PWM00TRG0_EN_MASK   (0x1U)
#define SIUL2_MUX1_TIMER_EN0_PWM00TRG0_EN_SHIFT  (0U)
#define SIUL2_MUX1_TIMER_EN0_PWM00TRG0_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM00TRG0_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM00TRG0_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM00TRG0_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM01TRG0_EN_MASK   (0x2U)
#define SIUL2_MUX1_TIMER_EN0_PWM01TRG0_EN_SHIFT  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM01TRG0_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM01TRG0_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM01TRG0_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM01TRG0_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM02TRG0_EN_MASK   (0x4U)
#define SIUL2_MUX1_TIMER_EN0_PWM02TRG0_EN_SHIFT  (2U)
#define SIUL2_MUX1_TIMER_EN0_PWM02TRG0_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM02TRG0_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM02TRG0_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM02TRG0_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM03TRG0_EN_MASK   (0x8U)
#define SIUL2_MUX1_TIMER_EN0_PWM03TRG0_EN_SHIFT  (3U)
#define SIUL2_MUX1_TIMER_EN0_PWM03TRG0_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM03TRG0_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM03TRG0_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM03TRG0_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM00TRG1_EN_MASK   (0x10U)
#define SIUL2_MUX1_TIMER_EN0_PWM00TRG1_EN_SHIFT  (4U)
#define SIUL2_MUX1_TIMER_EN0_PWM00TRG1_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM00TRG1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM00TRG1_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM00TRG1_EN_MASK)

