zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_SIUL2.h
/*! @name MUX2_TIMER_EN1 - MUX2_TIMER_EN1 */
/*! @{ */

#define SIUL2_MUX2_TIMER_EN1_PWM1MSTRELOAD_EN_MASK (0x1U)
#define SIUL2_MUX2_TIMER_EN1_PWM1MSTRELOAD_EN_SHIFT (0U)
#define SIUL2_MUX2_TIMER_EN1_PWM1MSTRELOAD_EN_WIDTH (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM1MSTRELOAD_EN(x) (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM1MSTRELOAD_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM1MSTRELOAD_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM10TRG0_EN_MASK   (0x10000U)
#define SIUL2_MUX2_TIMER_EN1_PWM10TRG0_EN_SHIFT  (16U)
#define SIUL2_MUX2_TIMER_EN1_PWM10TRG0_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM10TRG0_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM10TRG0_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM10TRG0_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM11TRG0_EN_MASK   (0x20000U)
#define SIUL2_MUX2_TIMER_EN1_PWM11TRG0_EN_SHIFT  (17U)
#define SIUL2_MUX2_TIMER_EN1_PWM11TRG0_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM11TRG0_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM11TRG0_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM11TRG0_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM12TRG0_EN_MASK   (0x40000U)
#define SIUL2_MUX2_TIMER_EN1_PWM12TRG0_EN_SHIFT  (18U)
#define SIUL2_MUX2_TIMER_EN1_PWM12TRG0_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM12TRG0_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM12TRG0_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM12TRG0_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM13TRG0_EN_MASK   (0x80000U)
#define SIUL2_MUX2_TIMER_EN1_PWM13TRG0_EN_SHIFT  (19U)
#define SIUL2_MUX2_TIMER_EN1_PWM13TRG0_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM13TRG0_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM13TRG0_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM13TRG0_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM10TRG1_EN_MASK   (0x100000U)
#define SIUL2_MUX2_TIMER_EN1_PWM10TRG1_EN_SHIFT  (20U)
#define SIUL2_MUX2_TIMER_EN1_PWM10TRG1_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM10TRG1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM10TRG1_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM10TRG1_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM11TRG1_EN_MASK   (0x200000U)
#define SIUL2_MUX2_TIMER_EN1_PWM11TRG1_EN_SHIFT  (21U)
#define SIUL2_MUX2_TIMER_EN1_PWM11TRG1_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM11TRG1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM11TRG1_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM11TRG1_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM12TRG1_EN_MASK   (0x400000U)
#define SIUL2_MUX2_TIMER_EN1_PWM12TRG1_EN_SHIFT  (22U)
#define SIUL2_MUX2_TIMER_EN1_PWM12TRG1_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM12TRG1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM12TRG1_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM12TRG1_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM13TRG1_EN_MASK   (0x800000U)
#define SIUL2_MUX2_TIMER_EN1_PWM13TRG1_EN_SHIFT  (23U)
#define SIUL2_MUX2_TIMER_EN1_PWM13TRG1_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM13TRG1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM13TRG1_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM13TRG1_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM10OUTA_EN_MASK   (0x1000000U)
#define SIUL2_MUX2_TIMER_EN1_PWM10OUTA_EN_SHIFT  (24U)
#define SIUL2_MUX2_TIMER_EN1_PWM10OUTA_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM10OUTA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM10OUTA_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM10OUTA_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM11OUTA_EN_MASK   (0x2000000U)
#define SIUL2_MUX2_TIMER_EN1_PWM11OUTA_EN_SHIFT  (25U)
#define SIUL2_MUX2_TIMER_EN1_PWM11OUTA_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM11OUTA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM11OUTA_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM11OUTA_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM12OUTA_EN_MASK   (0x4000000U)
#define SIUL2_MUX2_TIMER_EN1_PWM12OUTA_EN_SHIFT  (26U)
#define SIUL2_MUX2_TIMER_EN1_PWM12OUTA_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM12OUTA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM12OUTA_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM12OUTA_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM13OUTA_EN_MASK   (0x8000000U)
#define SIUL2_MUX2_TIMER_EN1_PWM13OUTA_EN_SHIFT  (27U)
#define SIUL2_MUX2_TIMER_EN1_PWM13OUTA_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM13OUTA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM13OUTA_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM13OUTA_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM10OUTB_EN_MASK   (0x10000000U)
#define SIUL2_MUX2_TIMER_EN1_PWM10OUTB_EN_SHIFT  (28U)
#define SIUL2_MUX2_TIMER_EN1_PWM10OUTB_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM10OUTB_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM10OUTB_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM10OUTB_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM11OUTB_EN_MASK   (0x20000000U)
#define SIUL2_MUX2_TIMER_EN1_PWM11OUTB_EN_SHIFT  (29U)
#define SIUL2_MUX2_TIMER_EN1_PWM11OUTB_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM11OUTB_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM11OUTB_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM11OUTB_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM12OUTB_EN_MASK   (0x40000000U)
#define SIUL2_MUX2_TIMER_EN1_PWM12OUTB_EN_SHIFT  (30U)
#define SIUL2_MUX2_TIMER_EN1_PWM12OUTB_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM12OUTB_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM12OUTB_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM12OUTB_EN_MASK)

#define SIUL2_MUX2_TIMER_EN1_PWM13OUTB_EN_MASK   (0x80000000U)
#define SIUL2_MUX2_TIMER_EN1_PWM13OUTB_EN_SHIFT  (31U)
#define SIUL2_MUX2_TIMER_EN1_PWM13OUTB_EN_WIDTH  (1U)
#define SIUL2_MUX2_TIMER_EN1_PWM13OUTB_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_TIMER_EN1_PWM13OUTB_EN_SHIFT)) & SIUL2_MUX2_TIMER_EN1_PWM13OUTB_EN_MASK)
/*! @} */

/*! @name MUX2_BCTU1_EN - MUX2_BCTU1_EN */
/*! @{ */

#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0DMA_EN_MASK (0x1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0DMA_EN_SHIFT (0U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0DMA_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1DMA_EN_MASK (0x2U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1DMA_EN_SHIFT (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1DMA_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2DMA_EN_MASK (0x4U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2DMA_EN_SHIFT (2U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2DMA_EN_MASK)

