zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_SIUL2.h
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC0DMA_EN_MASK (0x8U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC0DMA_EN_SHIFT (3U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC0DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC0DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1ADC0DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1ADC0DMA_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC1DMA_EN_MASK (0x10U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC1DMA_EN_SHIFT (4U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC1DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC1DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1ADC1DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1ADC1DMA_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC2DMA_EN_MASK (0x20U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC2DMA_EN_SHIFT (5U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC2DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC2DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1ADC2DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1ADC2DMA_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC3DMA_EN_MASK (0x40U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC3DMA_EN_SHIFT (6U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC3DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC3DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1ADC3DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1ADC3DMA_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0INT_EN_MASK (0x80U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0INT_EN_SHIFT (7U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1FIFO0INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1INT_EN_MASK (0x100U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1INT_EN_SHIFT (8U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1FIFO1INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2INT_EN_MASK (0x200U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2INT_EN_SHIFT (9U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1FIFO2INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1LISTINT_EN_MASK (0x400U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1LISTINT_EN_SHIFT (10U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1LISTINT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1LISTINT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1LISTINT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1LISTINT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC0INT_EN_MASK (0x800U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC0INT_EN_SHIFT (11U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC0INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC0INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1ADC0INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1ADC0INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC1INT_EN_MASK (0x1000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC1INT_EN_SHIFT (12U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC1INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC1INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1ADC1INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1ADC1INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC2INT_EN_MASK (0x2000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC2INT_EN_SHIFT (13U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC2INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC2INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1ADC2INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1ADC2INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC3INT_EN_MASK (0x4000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC3INT_EN_SHIFT (14U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC3INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU1ADC3INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU1ADC3INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU1ADC3INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0DMA_EN_MASK (0x10000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0DMA_EN_SHIFT (16U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0DMA_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1DMA_EN_MASK (0x20000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1DMA_EN_SHIFT (17U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1DMA_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2DMA_EN_MASK (0x40000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2DMA_EN_SHIFT (18U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2DMA_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC0DMA_EN_MASK (0x80000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC0DMA_EN_SHIFT (19U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC0DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC0DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0ADC0DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0ADC0DMA_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC1DMA_EN_MASK (0x100000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC1DMA_EN_SHIFT (20U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC1DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC1DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0ADC1DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0ADC1DMA_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC2DMA_EN_MASK (0x200000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC2DMA_EN_SHIFT (21U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC2DMA_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC2DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0ADC2DMA_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0ADC2DMA_EN_MASK)

