zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_SIUL2.h
#define SIUL2_GPDI155_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI155_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI155_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI155_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI155_PDI_n_SHIFT)) & SIUL2_GPDI155_PDI_n_MASK)
/*! @} */

/*! @name GPDI154 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI154_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI154_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI154_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI154_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI154_PDI_n_SHIFT)) & SIUL2_GPDI154_PDI_n_MASK)
/*! @} */

/*! @name GPDI159 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI159_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI159_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI159_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI159_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI159_PDI_n_SHIFT)) & SIUL2_GPDI159_PDI_n_MASK)
/*! @} */

/*! @name GPDI158 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI158_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI158_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI158_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI158_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI158_PDI_n_SHIFT)) & SIUL2_GPDI158_PDI_n_MASK)
/*! @} */

/*! @name GPDI157 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI157_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI157_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI157_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI157_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI157_PDI_n_SHIFT)) & SIUL2_GPDI157_PDI_n_MASK)
/*! @} */

/*! @name GPDI156 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI156_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI156_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI156_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI156_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI156_PDI_n_SHIFT)) & SIUL2_GPDI156_PDI_n_MASK)
/*! @} */

/*! @name GPDI163 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI163_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI163_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI163_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI163_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI163_PDI_n_SHIFT)) & SIUL2_GPDI163_PDI_n_MASK)
/*! @} */

/*! @name GPDI162 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI162_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI162_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI162_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI162_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI162_PDI_n_SHIFT)) & SIUL2_GPDI162_PDI_n_MASK)
/*! @} */

/*! @name GPDI161 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI161_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI161_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI161_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI161_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI161_PDI_n_SHIFT)) & SIUL2_GPDI161_PDI_n_MASK)
/*! @} */

/*! @name GPDI160 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI160_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI160_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI160_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI160_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI160_PDI_n_SHIFT)) & SIUL2_GPDI160_PDI_n_MASK)
/*! @} */

/*! @name GPDI167 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI167_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI167_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI167_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI167_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI167_PDI_n_SHIFT)) & SIUL2_GPDI167_PDI_n_MASK)
/*! @} */

/*! @name GPDI166 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI166_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI166_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI166_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI166_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI166_PDI_n_SHIFT)) & SIUL2_GPDI166_PDI_n_MASK)
/*! @} */

/*! @name GPDI165 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI165_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI165_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI165_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI165_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI165_PDI_n_SHIFT)) & SIUL2_GPDI165_PDI_n_MASK)
/*! @} */

/*! @name GPDI164 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI164_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI164_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI164_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI164_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI164_PDI_n_SHIFT)) & SIUL2_GPDI164_PDI_n_MASK)
/*! @} */

/*! @name GPDI171 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI171_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI171_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI171_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI171_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI171_PDI_n_SHIFT)) & SIUL2_GPDI171_PDI_n_MASK)
/*! @} */

/*! @name GPDI170 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI170_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI170_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI170_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI170_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI170_PDI_n_SHIFT)) & SIUL2_GPDI170_PDI_n_MASK)
/*! @} */

/*! @name GPDI169 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI169_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI169_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI169_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI169_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI169_PDI_n_SHIFT)) & SIUL2_GPDI169_PDI_n_MASK)
/*! @} */

