zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_SIUL2.h
#define SIUL2_PGPDO12_PPDO10_MASK                (0x400U)
#define SIUL2_PGPDO12_PPDO10_SHIFT               (10U)
#define SIUL2_PGPDO12_PPDO10_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO10(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO10_SHIFT)) & SIUL2_PGPDO12_PPDO10_MASK)

#define SIUL2_PGPDO12_PPDO11_MASK                (0x800U)
#define SIUL2_PGPDO12_PPDO11_SHIFT               (11U)
#define SIUL2_PGPDO12_PPDO11_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO11(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO11_SHIFT)) & SIUL2_PGPDO12_PPDO11_MASK)

#define SIUL2_PGPDO12_PPDO12_MASK                (0x1000U)
#define SIUL2_PGPDO12_PPDO12_SHIFT               (12U)
#define SIUL2_PGPDO12_PPDO12_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO12(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO12_SHIFT)) & SIUL2_PGPDO12_PPDO12_MASK)

#define SIUL2_PGPDO12_PPDO13_MASK                (0x2000U)
#define SIUL2_PGPDO12_PPDO13_SHIFT               (13U)
#define SIUL2_PGPDO12_PPDO13_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO13(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO13_SHIFT)) & SIUL2_PGPDO12_PPDO13_MASK)

#define SIUL2_PGPDO12_PPDO14_MASK                (0x4000U)
#define SIUL2_PGPDO12_PPDO14_SHIFT               (14U)
#define SIUL2_PGPDO12_PPDO14_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO14(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO14_SHIFT)) & SIUL2_PGPDO12_PPDO14_MASK)

#define SIUL2_PGPDO12_PPDO15_MASK                (0x8000U)
#define SIUL2_PGPDO12_PPDO15_SHIFT               (15U)
#define SIUL2_PGPDO12_PPDO15_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO15(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO15_SHIFT)) & SIUL2_PGPDO12_PPDO15_MASK)
/*! @} */

/*! @name PGPDO14 - SIUL2 Parallel GPIO Pad Data Out */
/*! @{ */

#define SIUL2_PGPDO14_PPDO3_MASK                 (0x8U)
#define SIUL2_PGPDO14_PPDO3_SHIFT                (3U)
#define SIUL2_PGPDO14_PPDO3_WIDTH                (1U)
#define SIUL2_PGPDO14_PPDO3(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO14_PPDO3_SHIFT)) & SIUL2_PGPDO14_PPDO3_MASK)

#define SIUL2_PGPDO14_PPDO4_MASK                 (0x10U)
#define SIUL2_PGPDO14_PPDO4_SHIFT                (4U)
#define SIUL2_PGPDO14_PPDO4_WIDTH                (1U)
#define SIUL2_PGPDO14_PPDO4(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO14_PPDO4_SHIFT)) & SIUL2_PGPDO14_PPDO4_MASK)

#define SIUL2_PGPDO14_PPDO5_MASK                 (0x20U)
#define SIUL2_PGPDO14_PPDO5_SHIFT                (5U)
#define SIUL2_PGPDO14_PPDO5_WIDTH                (1U)
#define SIUL2_PGPDO14_PPDO5(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO14_PPDO5_SHIFT)) & SIUL2_PGPDO14_PPDO5_MASK)

#define SIUL2_PGPDO14_PPDO6_MASK                 (0x40U)
#define SIUL2_PGPDO14_PPDO6_SHIFT                (6U)
#define SIUL2_PGPDO14_PPDO6_WIDTH                (1U)
#define SIUL2_PGPDO14_PPDO6(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO14_PPDO6_SHIFT)) & SIUL2_PGPDO14_PPDO6_MASK)

#define SIUL2_PGPDO14_PPDO7_MASK                 (0x80U)
#define SIUL2_PGPDO14_PPDO7_SHIFT                (7U)
#define SIUL2_PGPDO14_PPDO7_WIDTH                (1U)
#define SIUL2_PGPDO14_PPDO7(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO14_PPDO7_SHIFT)) & SIUL2_PGPDO14_PPDO7_MASK)

#define SIUL2_PGPDO14_PPDO8_MASK                 (0x100U)
#define SIUL2_PGPDO14_PPDO8_SHIFT                (8U)
#define SIUL2_PGPDO14_PPDO8_WIDTH                (1U)
#define SIUL2_PGPDO14_PPDO8(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO14_PPDO8_SHIFT)) & SIUL2_PGPDO14_PPDO8_MASK)
/*! @} */

/*! @name PGPDI1 - SIUL2 Parallel GPIO Pad Data In */
/*! @{ */

#define SIUL2_PGPDI1_PPDI0_MASK                  (0x1U)
#define SIUL2_PGPDI1_PPDI0_SHIFT                 (0U)
#define SIUL2_PGPDI1_PPDI0_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI0(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI0_SHIFT)) & SIUL2_PGPDI1_PPDI0_MASK)

#define SIUL2_PGPDI1_PPDI1_MASK                  (0x2U)
#define SIUL2_PGPDI1_PPDI1_SHIFT                 (1U)
#define SIUL2_PGPDI1_PPDI1_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI1(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI1_SHIFT)) & SIUL2_PGPDI1_PPDI1_MASK)

#define SIUL2_PGPDI1_PPDI2_MASK                  (0x4U)
#define SIUL2_PGPDI1_PPDI2_SHIFT                 (2U)
#define SIUL2_PGPDI1_PPDI2_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI2(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI2_SHIFT)) & SIUL2_PGPDI1_PPDI2_MASK)

#define SIUL2_PGPDI1_PPDI3_MASK                  (0x8U)
#define SIUL2_PGPDI1_PPDI3_SHIFT                 (3U)
#define SIUL2_PGPDI1_PPDI3_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI3(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI3_SHIFT)) & SIUL2_PGPDI1_PPDI3_MASK)

#define SIUL2_PGPDI1_PPDI5_MASK                  (0x20U)
#define SIUL2_PGPDI1_PPDI5_SHIFT                 (5U)
#define SIUL2_PGPDI1_PPDI5_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI5(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI5_SHIFT)) & SIUL2_PGPDI1_PPDI5_MASK)

#define SIUL2_PGPDI1_PPDI6_MASK                  (0x40U)
#define SIUL2_PGPDI1_PPDI6_SHIFT                 (6U)
#define SIUL2_PGPDI1_PPDI6_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI6(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI6_SHIFT)) & SIUL2_PGPDI1_PPDI6_MASK)

#define SIUL2_PGPDI1_PPDI7_MASK                  (0x80U)
#define SIUL2_PGPDI1_PPDI7_SHIFT                 (7U)
#define SIUL2_PGPDI1_PPDI7_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI7(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI7_SHIFT)) & SIUL2_PGPDI1_PPDI7_MASK)

#define SIUL2_PGPDI1_PPDI8_MASK                  (0x100U)
#define SIUL2_PGPDI1_PPDI8_SHIFT                 (8U)
#define SIUL2_PGPDI1_PPDI8_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI8(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI8_SHIFT)) & SIUL2_PGPDI1_PPDI8_MASK)

